cask_args appdir: '/Applications'

tap 'homebrew/dupes'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'

### Install GNU core utilities (those that come with OS X are outdated).
# Don’t forget to add `$(brew',args: ['--prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'
# Install some other useful utilities like `sponge`.
brew 'moreutils'
# Install GNU utilities
brew 'binutils', args: ['--with-default-names']
brew 'diffutils', args: ['--with-default-names']
brew 'homebrew/dupes/diffutils', args: ['--with-default-names']
brew 'ed',args: ['--with-default-names']
brew 'file-formula'
brew 'findutils',args: ['--with-default-names']
brew 'gawk'
brew 'gnu-indent',args: ['--with-default-names']
brew 'gnu-sed', args: ['--with-default-names']
brew 'gnu-sed',args: ['--with-default-names']
brew 'gnu-tar',args: ['--with-default-names']
brew 'gnu-which',args: ['--with-default-names']
brew 'gnupg'
brew 'gnupg2'
brew 'gnutls',args: ['--default-names']
brew 'grep',args: ['--with-default-names']
brew 'homebrew/dupes/grep',args: ['--with-default-names']
brew 'gzip'
brew 'screen'
brew 'homebrew/dupes/screen'

brew 'wdiff',args: ['--with-gettext']
brew 'wget', args: ['--with-iri']

# Install Bash 4.
brew 'bash'
brew 'bash-completion2'

# Install Python
brew 'python'
brew 'python3'

### Install other useful binaries.
# git tools
brew 'git'
brew 'git-lfs'
brew 'git-flow'
brew 'git-extras'
brew 'hub'
# Compression tools
brew 'p7zip'
brew 'pigz'
brew 'unrar'
# Install your public key in a remote machine's authorized_keys.
brew 'ssh-copy-id'
# Recursive directory listing command that produces a depth indented listing of files.
brew 'tree'
# A universal document converter.
brew 'pandoc'
## Text editors
brew 'vim',args: ['--override-system-vi']
brew 'nano'
## Misc
# Tool like grep, optimized for programmers Designed for programmers with large heterogeneous trees of source code.
brew 'ack'
brew 'htop'
brew 'less'
brew 'openssh'
brew 'homebrew/dupes/openssh'
# Pipe Viewer is an Open Source tool to monitor the progress of data through a pipeline between any two processes, giving a progress bar, ETA, etc.
brew 'pv'
# Command line tool to rename files according to modification rules specified.
brew 'rename'
brew 'rsync'
brew 'tmux'
# Lxml and Libxslt
brew 'libxml2'
brew 'libxslt'

# Core casks
cask 'alfred'
cask 'iterm2'
cask 'java'
cask 'xquartz'
cask 'google-chrome'
cask 'flux'
cask 'dropbox'

# Development tool casks
cask 'atom'
cask 'dash'
cask 'cyberduck'
cask 'gitkraken'
cask 'go2shell'

# Media-related
cask 'vlc'
cask 'mpv'
cask 'vox'
cask 'spotify'
cask 'spotify-notifications'
cask 'adobe-air'
cask 'cloud'
cask 'skitch'

# Misc
cask 'skype'
cask 'google-hangouts'
cask 'slack'
cask 'evernote'
cask 'the-unarchiver'
cask 'disk-inventory-x'
cask 'appcleaner'
cask 'flux'
cask 'cheatsheet'
cask 'namechanger'
cask 'spectacle'
cask 'jdownloader'
cask 'qbittorrent'
cask 'android-file-transfer'

#
# # Install developer friendly quick look plugins; see https://github.com/sindresorhus/quick-look-plugins
# cask 'qlcolorcode qlstephen qlmarkdown quicklook-json qlprettypatch quicklook-csv betterzipql qlimagesize webpquicklook suspicious-package'

## Mac App Store
brew 'mas'
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Keynote', id: 409183694
mas 'Amphetamine', id: 937984704
mas 'Wunderlist', id: 410628904

## Fonts
#fira
cask 'caskroom/fonts/font-fira-code'
cask 'caskroom/fonts/font-fira-mono-for-powerline'
cask 'caskroom/fonts/font-fira-mono'
cask 'caskroom/fonts/font-fira-sans'
cask 'caskroom/fonts/font-firacode-nerd-font-mono'
cask 'caskroom/fonts/font-firacode-nerd-font'
# fontawesome
cask 'caskroom/fonts/font-fontawesome'
# hack
cask 'caskroom/fonts/font-hack-nerd-font'
cask 'caskroom/fonts/font-hack'
# inconsolata
cask 'caskroom/fonts/font-inconsolata-dz-for-powerline'
cask 'caskroom/fonts/font-inconsolata-dz'
cask 'caskroom/fonts/font-inconsolata-for-powerline'
cask 'caskroom/fonts/font-inconsolata-g-for-powerline'
cask 'caskroom/fonts/font-inconsolata-lgc'
cask 'caskroom/fonts/font-inconsolata'
#roboto
cask 'caskroom/fonts/font-roboto-condensed'
cask 'caskroom/fonts/font-roboto-mono-for-powerline'
cask 'caskroom/fonts/font-roboto-mono'
cask 'caskroom/fonts/font-roboto-slab'
cask 'caskroom/fonts/font-roboto'
#source code pro
cask 'caskroom/fonts/font-source-code-pro-for-powerline'
cask 'caskroom/fonts/font-source-code-pro'
cask 'caskroom/fonts/font-source-han-code-jp'
cask 'caskroom/fonts/font-source-han-sans'
cask 'caskroom/fonts/font-source-sans-pro'
cask 'caskroom/fonts/font-source-serif-pro'
#ubuntu
cask 'caskroom/fonts/font-ubuntu-mono-derivative-powerline'
cask 'caskroom/fonts/font-ubuntu'
